# Beginner's Guide to using pandas

In [1]:
#import the necessary libraries
import pandas as pd

## We will begin by downloading a sample dataset

In [2]:
#use the pd.read_csv to get our file uploaded
df = pd.read_csv('toy_dataset.csv')

In [3]:
df.Number = df.Number -1

In [4]:
df.rename(columns={'Number':'index'}, inplace=True)
df.set_index('index', inplace=True)
df.head()

         City Gender  Age   Income Illness
index
0      Dallas   Male   41  40367.0      No
1      Dallas   Male   54  45084.0      No
2      Dallas   Male   42  52483.0      No
3      Dallas   Male   40  40941.0      No
4      Dallas   Male   46  50289.0      No

In [5]:
df['City']=='Dallas'

index
0          True
1          True
2          True
3          True
4          True
          ...
149995    False
149996    False
149997    False
149998    False
149999    False
Name: City, Length: 150000, dtype: bool

In [6]:
df['City']

index
0         Dallas
1         Dallas
2         Dallas
3         Dallas
4         Dallas
           ...
149995    Austin
149996    Austin
149997    Austin
149998    Austin
149999    Austin
Name: City, Length: 150000, dtype: object

## Using [ ] operator

In [7]:
df[['City','Age']]

          City  Age
index
0       Dallas   41
1       Dallas   54
2       Dallas   42
3       Dallas   40
4       Dallas   46
...        ...  ...
149995  Austin   48
149996  Austin   25
149997  Austin   26
149998  Austin   25
149999  Austin   37

[150000 rows x 2 columns]

In [12]:
df[df['City']=='Dallas']

         City  Gender  Age   Income Illness
index
0      Dallas    Male   41  40367.0      No
1      Dallas    Male   54  45084.0      No
2      Dallas    Male   42  52483.0      No
3      Dallas    Male   40  40941.0      No
4      Dallas    Male   46  50289.0      No
...       ...     ...  ...      ...     ...
19702  Dallas  Female   59  30021.0      No
19703  Dallas    Male   33  34643.0      No
19704  Dallas    Male   33  53190.0      No
19705  Dallas    Male   37  54265.0      No
19706  Dallas    Male   59  51265.0      No

[19707 rows x 5 columns]

In [13]:
df[df['Age']>=45]    #you can also use other comparisons

          City  Gender  Age   Income Illness
index
1       Dallas    Male   54  45084.0      No
4       Dallas    Male   46  50289.0      No
8       Dallas    Male   51  68667.0      No
10      Dallas  Female   48  41524.0     Yes
11      Dallas    Male   47  54777.0      No
...        ...     ...  ...      ...     ...
149987  Austin  Female   55  62501.0      No
149989  Austin    Male   52  83688.0      No
149991  Austin    Male   51  97510.0      No
149993  Austin    Male   64  89906.0      No
149995  Austin    Male   48  93669.0      No

[76479 rows x 5 columns]

In [10]:
#note both conditions must be inclosed in brackets
df[(df['Age']>=45) &(df['City']=='Dallas')]

         City  Gender  Age   Income Illness
index
1      Dallas    Male   54  45084.0      No
4      Dallas    Male   46  50289.0      No
8      Dallas    Male   51  68667.0      No
10     Dallas  Female   48  41524.0     Yes
11     Dallas    Male   47  54777.0      No
...       ...     ...  ...      ...     ...
19698  Dallas    Male   58  47757.0      No
19700  Dallas    Male   58  44083.0      No
19701  Dallas  Female   48  46132.0      No
19702  Dallas  Female   59  30021.0      No
19706  Dallas    Male   59  51265.0      No

[10076 rows x 5 columns]

## Using .loc operator

In [14]:
df.loc[0,'Gender']

'Male'

In [19]:
df.loc[1:4,'Gender':'Income']

      Gender  Age   Income
index
1       Male   54  45084.0
2       Male   42  52483.0
3       Male   40  40941.0
4       Male   46  50289.0

In [ ]:
df.loc[:,'Gender']

In [20]:
df.loc[1:4,:]

         City Gender  Age   Income Illness
index
1      Dallas   Male   54  45084.0      No
2      Dallas   Male   42  52483.0      No
3      Dallas   Male   40  40941.0      No
4      Dallas   Male   46  50289.0      No

In [21]:
df.loc[:,'Gender':'Income']   #return all rows and columns Gender through Income

        Gender  Age    Income
index
0         Male   41   40367.0
1         Male   54   45084.0
2         Male   42   52483.0
3         Male   40   40941.0
4         Male   46   50289.0
...        ...  ...       ...
149995    Male   48   93669.0
149996    Male   25   96748.0
149997    Male   26  111885.0
149998    Male   25  111878.0
149999  Female   37   87251.0

[150000 rows x 3 columns]

In [22]:
df.loc[:10,:]     #return start through index 10 and all columns

         City  Gender  Age   Income Illness
index
0      Dallas    Male   41  40367.0      No
1      Dallas    Male   54  45084.0      No
2      Dallas    Male   42  52483.0      No
3      Dallas    Male   40  40941.0      No
4      Dallas    Male   46  50289.0      No
5      Dallas  Female   36  50786.0      No
6      Dallas  Female   32  33155.0      No
7      Dallas    Male   39  30914.0      No
8      Dallas    Male   51  68667.0      No
9      Dallas  Female   30  50082.0      No
10     Dallas  Female   48  41524.0     Yes

In [23]:
#we can also select specific rows and columns
df.loc[[0,5,27,539], ['Income', 'Illness']]

        Income Illness
index
0      40367.0      No
5      50786.0      No
27     61704.0      No
539    44490.0      No

## Using .iloc